Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 observations (InputLayer)      [(None, 157)]        0           []                               
                                                                                                  
 fc_value_1 (Dense)             (None, 256)          40448       ['observations[0][0]']           
                                                                                                  
 fc_1 (Dense)                   (None, 256)          40448       ['observations[0][0]']           
                                                                                                  
 fc_value_2 (Dense)             (None, 256)          65792       ['fc_value_1[0][0]']             
                                                                                                  
 fc_2 (Dense)                   (None, 256)          65792       ['fc_1[0][0]']                   
                                                                                                  
 value_out (Dense)              (None, 1)            257         ['fc_value_2[0][0]']             
                                                                                                  
==================================================================================================
Total params: 212,737
Trainable params: 212,737
Non-trainable params: 0
__________________________________________________________________________________________________
