Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
observations (InputLayer)       [(None, 48)]         0                                            
__________________________________________________________________________________________________
fc_1 (Dense)                    (None, 256)          12544       observations[0][0]               
__________________________________________________________________________________________________
fc_value_1 (Dense)              (None, 256)          12544       observations[0][0]               
__________________________________________________________________________________________________
fc_2 (Dense)                    (None, 256)          65792       fc_1[0][0]                       
__________________________________________________________________________________________________
fc_value_2 (Dense)              (None, 256)          65792       fc_value_1[0][0]                 
__________________________________________________________________________________________________
fc_out (Dense)                  (None, 6)            1542        fc_2[0][0]                       
__________________________________________________________________________________________________
value_out (Dense)               (None, 1)            257         fc_value_2[0][0]                 
==================================================================================================
Total params: 158,471
Trainable params: 158,471
Non-trainable params: 0
__________________________________________________________________________________________________
