Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
observations (InputLayer)       [(None, 10, 10, 7)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 10, 10, 32)   256         observations[0][0]               
__________________________________________________________________________________________________
dense_block (DenseBlock)        (None, 10, 10, 128)  137952      conv2d[0][0]                     
__________________________________________________________________________________________________
dense_block_4 (DenseBlock)      (None, 10, 10, 128)  137952      conv2d[0][0]                     
__________________________________________________________________________________________________
transition_layer (TransitionLay (None, 5, 5, 64)     8768        dense_block[0][0]                
__________________________________________________________________________________________________
transition_layer_3 (TransitionL (None, 5, 5, 64)     8768        dense_block_4[0][0]              
__________________________________________________________________________________________________
dense_block_1 (DenseBlock)      (None, 5, 5, 128)    96192       transition_layer[0][0]           
__________________________________________________________________________________________________
dense_block_5 (DenseBlock)      (None, 5, 5, 128)    96192       transition_layer_3[0][0]         
__________________________________________________________________________________________________
transition_layer_1 (TransitionL (None, 3, 3, 64)     8768        dense_block_1[0][0]              
__________________________________________________________________________________________________
transition_layer_4 (TransitionL (None, 3, 3, 64)     8768        dense_block_5[0][0]              
__________________________________________________________________________________________________
dense_block_2 (DenseBlock)      (None, 3, 3, 128)    96192       transition_layer_1[0][0]         
__________________________________________________________________________________________________
dense_block_6 (DenseBlock)      (None, 3, 3, 128)    96192       transition_layer_4[0][0]         
__________________________________________________________________________________________________
transition_layer_2 (TransitionL (None, 2, 2, 64)     8768        dense_block_2[0][0]              
__________________________________________________________________________________________________
transition_layer_5 (TransitionL (None, 2, 2, 64)     8768        dense_block_6[0][0]              
__________________________________________________________________________________________________
dense_block_3 (DenseBlock)      (None, 2, 2, 96)     45984       transition_layer_2[0][0]         
__________________________________________________________________________________________________
dense_block_7 (DenseBlock)      (None, 2, 2, 96)     45984       transition_layer_5[0][0]         
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 96)           0           dense_block_3[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 96)           0           dense_block_7[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 5)            485         global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            97          global_average_pooling2d_1[0][0] 
==================================================================================================
Total params: 806,086
Trainable params: 798,150
Non-trainable params: 7,936
__________________________________________________________________________________________________
